Repository: mehrabix/wp-persian-datepicker-element
Catalog: languages/wp-persian-datepicker-element-*.po
Languages: fa_ir

source: Persian Date Picker Settings
fa_ir: تنظیمات انتخابگر تاریخ شمسی

source: Persian Date Picker
fa_ir: انتخابگر تاریخ شمسی

source: Integration Guide
fa_ir: راهنمای ادغام

source: General Settings
fa_ir: تنظیمات عمومی

source: Default Placeholder
fa_ir: متن راهنمای پیش‌فرض

source: Default Date Format
fa_ir: قالب تاریخ پیش‌فرض

source: Show Holidays
fa_ir: نمایش تعطیلات

source: Right-to-Left (RTL)
fa_ir: راست به چپ (RTL)

source: Dark Mode
fa_ir: حالت تاریک

source: Holiday Types
fa_ir: انواع تعطیلات

source: Range Mode
fa_ir: حالت انتخاب بازه

source: Configure the default settings for the Persian Date Picker component. These settings will be used as defaults for shortcodes and widgets unless overridden.
fa_ir: تنظیمات پیش‌فرض کامپوننت انتخابگر تاریخ شمسی را پیکربندی کنید. این تنظیمات به عنوان پیش‌فرض برای شورت‌کدها و ابزارک‌ها استفاده می‌شوند مگر اینکه بازنویسی شوند.

source: The placeholder text to show in the input field.
fa_ir: متن راهنما که در فیلد ورودی نمایش داده می‌شود.

source: The date format pattern (e.g. YYYY/MM/DD, YYYY-MM-DD).
fa_ir: الگوی قالب تاریخ (مثلاً YYYY/MM/DD, YYYY-MM-DD).

source: Show holidays in the calendar
fa_ir: نمایش تعطیلات در تقویم

source: Enable right-to-left layout
fa_ir: فعال‌سازی چیدمان راست به چپ

source: Enable dark mode
fa_ir: فعال‌سازی حالت تاریک

source: Comma-separated list of holiday types to display (Iran, Afghanistan, AncientIran, International). Use "all" to show all types.
fa_ir: لیست انواع تعطیلات با کاما جدا شده (Iran, Afghanistan, AncientIran, International). از "all" برای نمایش همه انواع استفاده کنید.

source: Enable date range selection mode
fa_ir: فعال‌سازی حالت انتخاب بازه تاریخ

source: Settings saved.
fa_ir: تنظیمات ذخیره شد.

source: Settings
fa_ir: تنظیمات

source: Shortcode Usage
fa_ir: نحوه استفاده از شورت‌کد

source: Preview
fa_ir: پیش‌نمایش

source: To display the Persian Date Picker in your content, use the following shortcode:
fa_ir: برای نمایش انتخابگر تاریخ شمسی در محتوای خود، از شورت‌کد زیر استفاده کنید:

source: You can customize the datepicker with various attributes:
fa_ir: می‌توانید انتخابگر تاریخ را با ویژگی‌های مختلفی سفارشی کنید:

source: Basic Usage
fa_ir: استفاده پایه

source: With Custom Placeholder
fa_ir: با متن راهنمای سفارشی

source: With Custom Format
fa_ir: با قالب سفارشی

source: RTL Direction
fa_ir: جهت راست به چپ

source: Custom Holiday Types
fa_ir: انواع تعطیلات سفارشی

source: Full Example
fa_ir: مثال کامل

source: Gutenberg Block
fa_ir: بلوک گوتنبرگ

source: You can also use the Persian Date Picker as a Gutenberg block. Simply search for "Persian Date Picker" in the block inserter.
fa_ir: شما همچنین می‌توانید از انتخابگر تاریخ شمسی به عنوان یک بلوک گوتنبرگ استفاده کنید. کافیست در درج‌کننده بلوک، عبارت «انتخابگر تاریخ شمسی» را جستجو کنید.

source: A Persian (Jalali) date picker widget.
fa_ir: یک ابزارک انتخابگر تاریخ شمسی (جلالی).

source: Title:
fa_ir: عنوان:

source: Placeholder:
fa_ir: متن راهنما:

source: Date Format:
fa_ir: قالب تاریخ:

source: e.g. YYYY/MM/DD or YYYY-MM-DD
fa_ir: مثلاً YYYY/MM/DD یا YYYY-MM-DD

source: Holiday Types:
fa_ir: انواع تعطیلات:

source: Comma-separated list: Iran,Afghanistan,AncientIran,International
fa_ir: لیست جدا شده با کاما: Iran,Afghanistan,AncientIran,International

source: Today
fa_ir: امروز

source: Tomorrow
fa_ir: فردا

source: Integration
fa_ir: ادغام
